src/cf/Catalogs/УдалитьПодписиПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УдалитьПодписиПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьПодписьДляНовыхСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПодписьПриОтветеИлиПересылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьПриОтветеФорматированныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДляНовыхФорматированныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаНовуюПодписьДляНовых</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписиПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаНовуюПодписьПриОтвете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписиПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/УдалитьПодписиПисем/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВладелецПодписи = Пользователи.ТекущийПользователь();
		
		ПодписьПоУмолчанию = Символы.ПС + Символы.ПС + "---------------------------------" + Символы.ПС;
		ПодписьHTML = Новый ФорматированнаяСтрока(ПодписьПоУмолчанию);
		ПодписьДляНовыхФорматированныйДокумент.УстановитьФорматированнуюСтроку(ПодписьHTML);
		ПодписьПриОтветеФорматированныйДокумент.УстановитьФорматированнуюСтроку(ПодписьHTML);
		
	Иначе
		ПодписьПриОтветеФорматированныйДокумент = Объект.Ссылка.ПодписьПриОтветеФорматированныйДокумент.Получить();
		ПодписьДляНовыхФорматированныйДокумент = Объект.Ссылка.ПодписьДляНовыхФорматированныйДокумент.Получить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтрокаСообщения = НСтр("ru = 'Не поддерживается копирование и вставка форматированного текста с картинками.
	|Подпись при ответе.'");
	
	ПодписьHTML = "";
	Картинки = Новый Структура;
	ПодписьПриОтветеФорматированныйДокумент.ПолучитьHTML(ПодписьHTML, Картинки);
	
	Если СтрНайти(НРег(ПодписьHTML), "e1c://") <> 0 Тогда
		ВызватьИсключение СтрокаСообщения;
	КонецЕсли;
	
	ПодписьHTML = "";
	Картинки = Новый Структура;
	ПодписьДляНовыхФорматированныйДокумент.ПолучитьHTML(ПодписьHTML, Картинки);
	
	Если СтрНайти(НРег(ПодписьHTML), "e1c://") <> 0 Тогда
		ВызватьИсключение СтрокаСообщения;
	КонецЕсли;
	
	ТекущийОбъект.ПодписьПриОтветеФорматированныйДокумент = 
	Новый ХранилищеЗначения(ПодписьПриОтветеФорматированныйДокумент);
	
	ТекущийОбъект.ПодписьДляНовыхФорматированныйДокумент = 
	Новый ХранилищеЗначения(ПодписьДляНовыхФорматированныйДокумент);
	
КонецПроцедуры

#КонецОбласти
